// 이용 약관 정책
class PolicyModel {
  static Map<int, String> policy = {
    1: "[필수] 이용약관 동의",
    2: "[필수] 개인정보 수집/이용 동의",
    3: "[필수] 연령 제한 및 법적 규정 동의",
    4: "[필수] 만 19세 이상 서비스 이용 동의",
    5: "[필수] 앱 이용 정보 수집 동의",
    6: "[선택] 알림 및 푸시 알림 동의",
    7: "[선택] 마케팅 및 광고 동의",
  };

  static Map<int, String> policyContents = {
    1: "[필수] 이용약관 동의 - 내용",
    2: "[필수] 개인정보 수집/이용 동의 - 내용",
    3: "[필수] 연령 제한 및 법적 규정 동의 - 내용",
    4: "[필수] 만 19세 이상 서비스 이용 동의 - 내용",
    5: "[필수] 앱 이용 정보 수집 동의 - 내용",
    6: "[선택] 알림 및 푸시 알림 동의 - 내용",
    7: "[선택] 마케팅 및 광고 동의 - 내용",
  }; 
}
